---
kind: type
id: T:Autodesk.Revit.DB.Visibility
source: html/0927cebc-d2fc-3411-26d7-1927f3b68e09.htm
---
# Autodesk.Revit.DB.Visibility

Describes the visibility of a particular geometry object.

## Syntax (C#)
```csharp
public enum Visibility
```